# Возрастные рейтинги
AGE_RATING_CHOICES = [
    (0, '0+'),
    (6, '6+'),
    (12, '12+'),
    (16, '16+'),
    (18, '18+'),
]

# Пользовательские оценки фильма
RATING_CHOICES = [
    (None, '-- Оцените --'),
    (1, '1★'), (2, '2★'), (3, '3★'), (4, '4★'), (5, '5★'),
    (6, '6★'), (7, '7★'), (8, '8★'), (9, '9★'), (10, '10★'),
]

# Оценки фильмов
MOVIE_RATING_CHOICES = [(i, str(i)) for i in range(1, 11)]

# Максимальные длины строк
NAME_MAX_LENGTH = 128

# Пути для загрузки файлов
POSTER_UPLOAD_PATH = 'posters/'